{"slug":"looking-back-looking-ahead","author":"Farhan Ahmad","title":"Looking Back, Looking Ahead","summary":"A look at where we have been and what's next.","id":"2020-05-29T15:45:00.000Z--looking-back-looking-ahead","createdAt":"2020-05-29T15:45:00.000Z--looking-back-looking-ahead","html":"<p>Hello Volunteers!</p>\n<p>We hope you are staying safe. </p>\n<p>Two months ago, we started the CV19 Assist initiative to help flatten the COVID-19 curve by helping the at-health-risk population minimize their exposure to the virus. We went live with the website within a week of our announcement. We have focused mostly on the local Madison-Wisconsin geographical area and got some good news coverage. This coverage helped us enroll about 250 volunteers who graciously offered to help with deliveries and all other tasks.</p>\n<p>Overall, although reaching out to our target demographic has been a bit challenging, we still did a lot of good. Below is an excerpt from one of the requests.</p>\n<blockquote>\n  <p>I am 75 with no family nearby to help. I have already placed and paid online for an order for curbside pick up at … This is such a blessing! Thank you so very, very much! I was thinking about cancelling the order because the church can't help so I had planned to go get it myself but now the CDC wants us old folks to be extra careful to not go any where at all this week or next, so I'm scared to do it. Again, bless you! This is such a wonderful blessing! Thank you so very much. </p>\n</blockquote>\n<p>Besides the numerous grocery deliveries that the volunteers made, we also provided about $2,500 worth of financial aid, which was funded by the Madison Muslim community.</p>\n<p>There have been many volunteers who helped with software development, but we would like to give a special shoutout to Prescott Prue, Deniz Simsek, Maaz Baig, and Jessie Luo for all their extra effort.</p>\n<p>Now that the grocery stores and delivery companies are catching up with the demand, and as our society is learning how to better deal with coronavirus, we feel that we have achieved our initiative's goal. In the coming two weeks, the development team will be adding email notifications in case we get any more requests (as the website will still be up and running).  Besides this last set of changes, we are not planning on making any more changes unless the need comes up again (which we hope does not!!). If you do see more requests come from CV19 Assist, please help fulfill them as you have done in the past.</p>\n<p>On a general note, if you have COVID-19 related needs or are helping others in need, please check out the very helpful, volunteer-created <a href=\"http://www.madisoncovid.com\">http://www.madisoncovid.com/</a>. If you are curious, the source code for our website is available on GitHub at <a href=\"https://github.com/cv19assist\">https://github.com/cv19assist</a>.</p>\n<p>Lastly, whether you got the opportunity to make a delivery or not, we want to thank you very much for signing up and making yourselves available to help those in need. You are the best part of this initiative, and we hope our world gets to see many more like you.</p>\n<p>Stay safe!</p>\n<ul>\n<li>Farhan Ahmad, Saad Baig and Steven Knurr - <a href=\"https://cv19assist.com/\">CV19 Assist</a></li>\n</ul>"}